{
  "channel": {
    "bookmarked": false,
    "title": {
      "__cdata": "The Economist - Medium"
    },
    "description": {
      "__cdata": "Insight and opinion on international news, politics, business, finance, science, technology, books and arts - Medium"
    },
    "link": [
      "https://medium.economist.com?source=rss----ae7c30c8cbcc---4",
      {
        "_href": "https://medium.economist.com/feed",
        "_rel": "self",
        "_type": "application/rss+xml"
      },
      {
        "_href": "http://medium.superfeedr.com",
        "_rel": "hub"
      }
    ],
    "image": {
      "url": "https://cdn-images-1.medium.com/proxy/1*TGH72Nnw24QL3iV9IOm4VA.png",
      "title": "The Economist - Medium",
      "link": ["https://medium.economist.com?source=rss----ae7c30c8cbcc---4"]
    },
    "generator": "Medium",
    "lastBuildDate": "Tue, 18 Oct 2022 01:00:21 GMT",
    "webMaster": {
      "__cdata": "yourfriends@medium.com"
    },
    "item": [
      {
        "bookmarked": false,
        "id": 10,
        "title": {
          "__cdata": "Measuring the true toll of the pandemic"
        },
        "link": [
          "https://medium.economist.com/measuring-the-true-toll-of-the-pandemic-fa7e003b3ff4?source=rss----ae7c30c8cbcc---4"
        ],
        "guid": {
          "_isPermaLink": "false",
          "__text": "https://medium.com/p/fa7e003b3ff4"
        },
        "category": [
          {
            "__cdata": "data-visualization"
          },
          {
            "__cdata": "coronavirus"
          },
          {
            "__cdata": "journalism"
          },
          {
            "__cdata": "covid19"
          },
          {
            "__cdata": "data-journalism"
          }
        ],
        "creator": {
          "__cdata": "James Tozer"
        },
        "pubDate": "Fri, 24 Apr 2020 17:05:41 GMT",
        "updated": {
          "__text": "2020-04-24T17:08:11.240Z"
        },
        "encoded": {
          "__cdata": "<h4><em>How The Economist measures excess deaths caused by covid-19</em></h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/731/0*wrwUoVP5A5rsmmdv\" /></figure><p>One of the grim ironies of the covid-19 pandemic is that the world has shown an unprecedented interest in data — and yet there has never been so much uncertainty around official statistics. Facebook and Twitter have become catalogues of terrifying charts, as people around the globe have tried to work out how quickly the SARS-CoV-2 virus is spreading. Meanwhile, academics and journalists have come up with lots of inventive ways to quantify the impact of the pandemic. <em>The Economist</em> has, for example, published analyses of <a href=\"https://www.economist.com/graphic-detail/2020/03/07/tourism-flows-and-death-rates-suggest-covid-19-is-being-under-reported\">tourist flows</a>, <a href=\"https://www.economist.com/graphic-detail/2020/03/14/foot-traffic-has-fallen-sharply-in-cities-with-big-coronavirus-outbreaks\">footfall in major global cities</a> and <a href=\"https://www.economist.com/graphic-detail/2020/04/18/how-the-internet-has-changed-during-lockdowns\">internet usage</a>.</p><p>Yet we still don’t know the numbers that matter most. Because countries have different testing capabilities, and many carriers show no symptoms, we don’t know how many people the virus has infected. More worryingly, we don’t even know exactly how many people it has killed. As I <a href=\"https://www.economist.com/graphic-detail/2020/04/03/covid-19s-death-toll-appears-higher-than-official-figures-suggest\">reported in early April</a>, the official covid-19 tolls in many countries exclude victims who were not tested before passing away. It often takes several days to establish and report the cause of death, creating a lag in the data. And if hospitals are overwhelmed, people with other conditions might not get the intensive care they need to survive. As a result, the numbers of deceased that get read out each night on the news are smaller than the true number of fatalities that the virus has already caused.</p><p>During medical crises such as this one, a better way to measure mortality is to look at a region’s “excess deaths”: the number of people who have died of all causes, compared with the average for the same period in previous years. I have been using two approaches to do this. The first is to take publicly available data about mortality, produced regularly by a handful of statistical bureaus, and estimate how many more people have died than usual in a selection of places. The second is to use figures from <a href=\"https://www.euromomo.eu/\">EuroMOMO</a>, a network of epidemiologists in 24 European countries, which covers 350m people in its weekly reports. As the pandemic continues, I will update all of these datasets on <a href=\"https://www.economist.com/graphic-detail/2020/04/16/tracking-covid-19-excess-deaths-across-countries\">our excess-mortality tracker, which is available free to all readers</a>.</p><h4><strong>How I calculated The Economist’s estimates</strong></h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/589/0*jY0k0vjTDHwv4chu\" /><figcaption><em>For each country or region, we have compared excess deaths with official covid-19 figures</em></figcaption></figure><p>One of the biggest challenges when it comes to measuring the spread of the virus is that every country collects its data differently. This is particularly true for the official covid-19 figures. For example, France has conducted a considerable amount of testing in care-homes, and includes fatalities from such institutions in its daily tolls, whereas almost all of the Netherlands’ reported deaths have occurred in hospitals.</p><p>Yet the data about deaths from all causes, which might seem more straightforward to collect, also vary in quality and frequency across countries. Spain’s Carlos III Institute, its national epidemiology centre, is publishing <a href=\"https://momo.isciii.es/public/momo/dashboard/momo_dashboard.html#ccaa\">daily figures for each region</a> — but these have a large lag, and are increased retrospectively when newer data come in (see chart below). By contrast, Britain’s Office for National Statistics produces <a href=\"https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/weeklyprovisionalfiguresondeathsregisteredinenglandandwales\">a weekly total of the number of death certificates registered in its system</a>, which are not revised in future. So the comparisons between countries are not entirely apples-to-apples. We have also had to use a simple method for our baseline of “expected deaths”: an average for the same week in previous years (ideally the past five years, but sometimes two or three, depending on availability).</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*Ra5cOexTmK7rG77q\" /><figcaption><em>Spain’s daily data on total deaths are often revised retrospectively</em></figcaption></figure><p>Moreover, some countries have reported only partial mortality data, which cover a non-random selection of regions or victims. In <a href=\"https://turkiye.gov.tr/istanbul-buyuksehir-belediyesi-vefat-sorgulama\">Istanbul</a> and <a href=\"https://pertamananpemakaman.jakarta.go.id/v140/t15\">Jakarta</a>, the two non-Western places currently in our tracker, I am relying on tallies of the number of people who have been buried, as reported by local departments. These figures will not pick up everybody who has died, but they are still much higher than the official covid-19 tolls. Turkey does not even give regular breakdowns of covid-19 deaths by region, so we had to estimate that Istanbul had half of the national share, based on a report from April 1st. Given how slowly many developing countries publish their all-cause mortality data, I will probably have to use a similar approach to find numbers in South America, Africa, Asia and the Middle East.</p><p>Even some rich nations do not have complete data. Italy’s National Institute of Statistics (ISTAT) has released <a href=\"https://www.istat.it/it/archivio/240401\">figures on all deaths</a> for just 1,700 of the country’s 7,900 municipalities (or <em>comuni</em>) — only the ones that have both shown at least a 20% increase this year and claim to have accurate records. This makes it impossible to come up with a national tally of excess deaths in the European country that was hit hardest. However, because these <em>comuni </em>cover 7.2m of the 10m people in Lombardy, the worst-affected Italian region, I was able to produce an estimate for that area. I found <a href=\"https://www.arcgis.com/home/webmap/viewer.html?url=https://services1.arcgis.com/XannvQVnsM1hoZyv/ArcGIS/rest/services/COMUNI_COVID19/FeatureServer&amp;source=sd\">a snapshot map</a> of official covid-19 deaths for those <em>comuni</em> at the end of March, and used that to predict what share of Lombardy’s deaths these 7.2m people suffered each week.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/622/0*O4ABWgsvJevc04LX\" /><figcaption><em>Our estimate of total and covid-19 deaths in Lombardy, based on the available comuni</em></figcaption></figure><p>All of this data-cleaning is fiddly and time-consuming, especially because the underlying spreadsheets are in different formats and languages. Whenever new data are published, I check them carefully, in case the definitions have changed. <a href=\"https://github.com/nychealth/coronavirus-data/blob/master/probable-confirmed-dod.csv\">New York’s official death toll</a>, for example, has started to include people who “probably” died of covid-19, according to the symptoms on their death certificates. To make this process more organised, I wrote a script in R, the programming language used most often by data journalists at <em>The Economist</em>, to do the cleaning for me. It is about 1,000 lines long, and spits out CSV files in the same format for each country. Those go into a Github repository, which <a href=\"https://twitter.com/martgnz\">Martín González</a>, one of our brilliant interactive journalists, uses to make the dynamic charts for our tracker. We hope that, at some point, once we have made the code presentable, to make this resource publicly available — keep checking <a href=\"https://github.com/TheEconomist\">our GitHub</a>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/813/0*ABZyUpi55xJcItaL\" /><figcaption><em>I’ve used an R script to clean the raw data files from each country, often in a foreign language!</em></figcaption></figure><h4><strong>How EuroMOMO comes up with its estimates</strong></h4><p>Although I have been able to find mortality numbers for many European countries, not all of them make these data publicly available in a timely fashion. Germany, for example, has only released <a href=\"https://www.destatis.de/DE/Themen/Gesellschaft-Umwelt/Bevoelkerung/Sterbefaelle-Lebenserwartung/sterbefallzahlen.html\">nationwide figures up to March 13th</a> (at the time of writing), since like Italy it struggles to coordinate lots of regional offices.</p><p>To get around this, I’ve collaborated with EuroMOMO’s epidemiologists. They collect mortality data on a weekly basis across Europe, which we will include on our tracker. And while they don’t break down the absolute numbers of fatalities by country, they do provide a trend chart for each member state <a href=\"https://www.euromomo.eu/graphs-and-maps/#z-scores-by-country\">on their website</a>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/786/0*B2zkeyFdjzfM22TH\" /><figcaption><em>EuroMOMO’s data show that covid-19 has far surpassed even the worst flu seasons</em></figcaption></figure><p>In this respect, EuroMOMO is a unique resource. No other continent has such a coordinated system. The United States has a <a href=\"https://gis.cdc.gov/grasp/fluview/mortality.html\">“Pneumonia and Influenza Mortality Surveillance” tool</a>, which publishes weekly total deaths for each state. But states take months to update their figures, which is why we have only included the city of New York in our tracker so far.</p><p>While working with EuroMOMO, I spoke to Lasse Skafte Vestergaard, to find out more about how the data are collected and what the limitations might be. Lasse coordinates the network, and helps put together the bulletin that the group publishes each Thursday. He is also an epidemiologist at Denmark’s national institute for infectious disease, and has specialised in influenza, malaria and parasitology.</p><p><strong>JT: Lasse, your organisation is the only one that tracks excess mortality across an entire continent. How did this come about?</strong></p><p>LSV: EuroMOMO’s network was set up in response to the global influenza pandemic in 2009, to ensure early detection of future public health events. Currently we have 28 partner institutions across 24 countries and regions. We also have representatives from the European Centre for Disease Prevention and Control (ECDC) and the World Health Organization (WHO) Regional Office for Europe, who both support the network activities and our hub financially, participate in technical discussions, and help our active strategy to expand geographical coverage, especially in Eastern Europe. For example, Ukraine has recently started to provide monthly data to the hub. One of the great strengths of our approach has been its consistency and close collaboration between participating countries, running week after week, year after year. Putting together the national data from all of them adds power to detect smaller changes than what individual countries may immediately see.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/797/0*xbzBbWD9lcQaqpqC\" /><figcaption><em>Deaths among people aged 15–64 have risen significantly, as well as those among over 65s</em></figcaption></figure><p><strong>JT: How comprehensive are your numbers?</strong></p><p>LSV: Our data come from national or regional statistical offices, and are typically based on information on deaths recorded in civil registers. Overall, our sample covers a substantial proportion of the European population, with more than 350 million people. However, the fraction covered varies quite a lot between countries, from 95–100% in many to only 15–20% in others. This all depends on local administrative systems and political decisions.</p><p><strong>JT: Are there any limitations that people interpreting the numbers should be aware of?</strong></p><p>First of all, we are providing mortality estimates, based on certain statistical models and assumptions, not the exact numbers of deaths. There will always be some level of uncertainty around them. Secondly, the coverage in some countries is only for a few selected regions or cities, for example in Germany and Italy. Since we are looking at national-level estimates, the observed figures may not adequately detect much higher mortality levels within smaller parts of a country. Finally, even the best quality reporting is not fully complete, and there are always a few days or weeks of delay. We apply an adjustment function in the statistical algorithms, but still, the estimates provided for the most recent weeks must be read with caution.</p><p><strong>JT: Some readers might look at EuroMOMO’s charts and think that the death toll from covid-19 is no worse than from some of the recent flu seasons. How would you respond?</strong></p><p>LSV: Given the dramatic mortality signals we are already seeing, especially in some parts of Europe, we can conclude that this pandemic is not just another flu — not at all. It is striking to see large variation, from extremely high excesses in one country to normal levels in neighbouring ones. We will later have to evaluate the effect of the various societal preventive measures, initiated with different speeds and levels of coverage. Then we can conclude what should be recommended in terms of preparedness for future pandemics.</p><p>We don’t yet know how long we will keep updating <em>The Economist</em>’s tracker. If the pandemic surges and then abates over several months, as countries go into and out of periods of lockdown, then excess mortality figures will be an important measure of how well social-distancing policies are working, and when they need to be enforced. I will keep digging away at official reports and spreadsheets in various languages, and expanding our ever-more tangled R script. If any readers spot data that we could use, or corrections that we need to make to the existing numbers, those would be very helpful — and I would be happy to hear about them at <a href=\"mailto:jamestozer@economist.com\">jamestozer@economist.com</a>.</p><p><a href=\"https://twitter.com/J_CD_T\"><em>James Tozer</em></a><em> is a data journalist at </em><a href=\"https://www.economist.com/graphic-detail/\">The Economist</a><em>. You can follow The Economist Data Team’s work on </em><a href=\"https://twitter.com/ECONdailycharts\"><em>Twitter</em></a><em>.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=fa7e003b3ff4\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.economist.com/measuring-the-true-toll-of-the-pandemic-fa7e003b3ff4\">Measuring the true toll of the pandemic</a> was originally published in <a href=\"https://medium.economist.com\">The Economist</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
        }
      },
      {
        "bookmarked": false,
        "id": 11,
        "title": {
          "__cdata": "Why you sometimes need to break the rules in data viz"
        },
        "link": [
          "https://medium.economist.com/why-you-sometimes-need-to-break-the-rules-in-data-viz-4d8ece284919?source=rss----ae7c30c8cbcc---4"
        ],
        "guid": {
          "_isPermaLink": "false",
          "__text": "https://medium.com/p/4d8ece284919"
        },
        "category": [
          {
            "__cdata": "information-design"
          },
          {
            "__cdata": "data"
          },
          {
            "__cdata": "infographics"
          },
          {
            "__cdata": "journalism"
          },
          {
            "__cdata": "data-visualization"
          }
        ],
        "creator": {
          "__cdata": "Rosamund Pearce"
        },
        "pubDate": "Fri, 28 Feb 2020 17:56:09 GMT",
        "updated": {
          "__text": "2020-02-28T17:56:09.023Z"
        },
        "encoded": {
          "__cdata": "<h4>Best practices help us to avoid common pitfalls in data visualisation — but we shouldn’t follow them blindly</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Q1vM3UKVjRlrI1YqYtP5EQ.png\" /></figure><p>It’s easy to visualise data badly. Choose the wrong chart type, omit labels or overload the graphic and you can quickly end up with something that is confusing, misleading or that fails to tell a story.</p><p>To combat such crimes, a number of best practices have sprung up as the field of data visualisation has matured. From steering clear of pie charts to getting rid of “chartjunk”, these are the conventions anyone dabbling in data viz should learn first.</p><p>But sometimes it’s helpful to revisit the things we learn early on with the benefit of experience. In the six years that I have been making data visualisations, I’ve found that sticking doggedly to the “rules” can sometimes impede effective visual communication. It’s easy to get bogged down in following technicalities, and lose sight of what actually <em>works</em>.</p><p>The trouble is that best practices tend to have little nuance, and there are times when they may be irrelevant, or worth the cost of breaking. Since joining <em>The Economist</em> I have broken many of them myself. But if you are going to do the same, it’s helpful to understand why they became rules of thumb in the first place. As the old saying goes, you have to know the rules before you can break them.</p><p>With this in mind, and with the help of <em>The Economist</em>’s<em> </em>archive, I’ve re-examined five things I was taught not to do when I first started out in data visualisation.</p><h3>1: Don’t break the y-axis scale</h3><p><em>The Economist</em> occasionally gets complaints from readers about charts where the numerical axis doesn’t start at zero. It’s no wonder they are treated with suspicion. A truncated axis can cause small differences to appear larger, or make a rise or fall look more dramatic. The misleading use of broken scales — particularly by <a href=\"https://www.washingtonpost.com/graphics/politics/2016-election/trump-charts/?\">political campaigns</a> — has given axis-breaking a bad reputation. But sometimes small variations between data are important, and you need to limit the range of the chart in order to make the story visible:</p><figure><img alt=\"Chart: Tipping habits of Uber riders, with broken axes\" src=\"https://cdn-images-1.medium.com/max/996/1*Q6lkJOdgszWm9g8dISJUIw.png\" /><figcaption><a href=\"https://www.economist.com/graphic-detail/2019/10/29/how-much-should-you-tip-an-uber-driver\"><em>Original chart</em></a></figcaption></figure><figure><img alt=\"The same chart with unbroken axes\" src=\"https://cdn-images-1.medium.com/max/996/1*GRaNXL9Goza9379QK-AUxw.png\" /><figcaption><em>The same chart with unbroken axes</em></figcaption></figure><p>In this chart I made about the tipping habits of Uber riders, starting the scale at zero hides the story because the differences — though significant — are small and not close to zero. It’s necessary to break the axes to show these differences. At <em>The Economist</em> we always use a symbol to signpost a broken scale, except for index charts:</p><figure><img alt=\"Indexed line chart: The impact of virus outbreaks on aviation\" src=\"https://cdn-images-1.medium.com/max/996/1*45wVrl7oZCAUSx-wCddTFQ.png\" /><figcaption><em>100 is treated as the baseline in </em><a href=\"https://www.economist.com/graphic-detail/2020/02/03/airlines-will-be-hit-hard-by-coronavirus\"><em>index charts</em></a><em> so a broken scale icon isn’t necessary</em></figcaption></figure><p>The one time you shouldn’t break an axis is when making a bar or column chart because it breaks the relationship between the rectangle’s dimensions and the data.</p><figure><img alt=\"Breaking bar chart axes, a comparison of The Economist’s old and modern styles\" src=\"https://cdn-images-1.medium.com/max/1024/1*xRwFyfv9GeB4rUbCIuiDqw.png\" /><figcaption><em>In our modern style (right, from 2019) we use a thermometer chart instead of a bar chart (left, from 2006) when we break the numerical axis</em></figcaption></figure><h3>2: Don’t go 3D</h3><figure><img alt=\"A 3D column chart\" src=\"https://cdn-images-1.medium.com/max/660/1*TlU7TWPWtC1tXTC5zlKT0Q.jpeg\" /><figcaption>Can you accurately decipher this? I can’t. Source: <a href=\"https://viz.wtf/post/164260261516/impact-categories-easy-presented\">WTF Viz</a></figcaption></figure><p>Ever since Microsoft Excel launched a thousand 3D pie charts into business meetings, 3D charts have been among the most vilified of data visualisations. There are two types of 3D visualisations: ones where the third dimension is used to depict a third variable, and others where it is purely cosmetic. Decorative 3D is <a href=\"https://serialmentor.com/dataviz/no-3d.html\">particularly frowned upon</a> as it needlessly distorts the data in multiple ways: perspective causes nearer items to appear larger, and using volume to represent a single variable magnifies the appearance of larger data points.</p><p>Using 3D to depict three variables, while slightly more justifiable, often results in a chart that is difficult to interpret. And for a static chart, it’s impossible to pick an angle that provides one objective view of the data — whichever way you view it, some elements will be emphasised more than others. Mostly it’s better to find another way to show a third variable — by bubble size, for instance:</p><figure><img alt=\"Bubble chart: GDP and fertility, 2017\" src=\"https://cdn-images-1.medium.com/max/1024/1*8iucMMJgtXeZ9oAnb4e5fQ.png\" /><figcaption><a href=\"https://www.economist.com/graphic-detail/2019/08/30/south-koreas-fertility-rate-falls-to-a-record-low\"><em>Three variables in 2D</em></a></figcaption></figure><p>But 3D can work well under <a href=\"https://www.visualisingdata.com/2015/03/when-3d-works/\">certain circumstances</a>. In the following visualisation for <em>The Economist’s </em>Graphic Detail section, we used a series of cubes to show the relative volume change of Arctic Sea ice:</p><figure><img alt=\"Graphic detail: Data visualisation and map of arctic sea ice change\" src=\"https://cdn-images-1.medium.com/max/1024/1*AwpOtP6v5HT4NorPw-UcZg.jpeg\" /><figcaption><a href=\"https://www.economist.com/graphic-detail/2019/09/21/the-consequences-of-a-rapidly-warming-arctic-will-be-felt-far-afield\"><em>Relative volume change of Arctic sea ice, as three ice cubes</em></a><em> (top right)</em></figcaption></figure><p>I think we got away with breaking the convention against using 3D because:</p><ul><li>There is a good reason for going 3D, given that we want to represent something that actually has three dimensions</li><li>We used an isometric projection — which lacks perspective — so there is no distortion between elements in the foreground and background</li><li>Rather than using a scale, which can be harder to read in 3D, we directly labelled the data</li><li>Smaller elements go in front, so as little is obscured as possible</li></ul><p>3D can also work better in visualisations that are animated or <a href=\"https://pudding.cool/2018/10/city_3d/\">interactive</a>, because you aren’t restricted to one view.</p><h3>3: Get rid of “chartjunk” to maximise the data-ink ratio</h3><p>The term “chartjunk” was coined by the statistician Edward Tufte to describe anything on a chart that is not central to interpreting it. Tufte deemed things like illustrations and fancy fonts to be an unwelcome distraction:</p><blockquote>“Cosmetic decoration, which frequently distorts the data, will never salvage an underlying lack of content. If the numbers are boring, then you’ve got the wrong numbers.”</blockquote><blockquote>“Every bit of ink on a graphic requires a reason. And nearly always that reason should be that the ink presents new information”</blockquote><p><em>Edward Tufte, Visual Display of Quantitative Information, 1983</em></p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*gVoOdgZ4AYl8xkKBwZAdSQ.png\" /><figcaption><em>Tufte would probably not approve of the cartoon in this chart from a 1997 edition of The Economist. Or the shading. Or the broken scales…</em></figcaption></figure><p>Tufte’s ideas helped prompt a shift towards minimalism in data visualisation that remains influential. It was probably one of the first rules that I learned. But there has been some pushback against stripping charts back to their bare bones, including from data visualisation consultant Alberto Cairo.</p><blockquote>“…gridlines in a time-series chart, or unobtrusive and subtle icons that identify the topic the chart discusses — might not be junk at all. Far from obstacles to understanding, they may <em>enhance</em> understanding.”</blockquote><p><em>Alberto Cairo, The Functional Art</em></p><p>A <a href=\"https://www.researchgate.net/publication/221517808_Useful_Junk_The_effects_of_visual_embellishment_on_comprehension_and_memorability_of_charts\">study</a> in 2010 also questioned a wholly minimalist approach to chart design, after finding that more embellished charts are better remembered — and just as well interpreted. <a href=\"https://vcg.seas.harvard.edu/files/pfister/files/infovis_submission251-camera.pdf\">Another</a> from 2015 found that charts with extra “redundant” labels — that reiterate the main trend in a visualisation — were better understood, while charts with icons were better recalled. No wonder most information designers don’t follow Tufte’s advice to the letter.</p><p>While I favour decluttering charts, I also want to help the reader out. There is a distinction between superfluous decoration and extra visual elements that provide a cue to the topic or reinforce a key finding. There’s nothing wrong with a bit of hand-holding — particularly with a challenging subject.</p><p>In the density plot that I made below, the labels “Speak more quickly” and “Convey information more quickly” repeat information already given in the subtitles. Under Tufte’s definition they would be considered as “junk”, as they don’t present new information — but they help the viewer understand the axes much faster.</p><figure><img alt=\"Density plot: syllable rate and information rate in selected languages\" src=\"https://cdn-images-1.medium.com/max/996/1*vGJpNBZ4VmTelvpV7vLrAw.png\" /><figcaption><a href=\"https://www.economist.com/graphic-detail/2019/09/28/why-are-some-languages-spoken-faster-than-others\"><em>Why are some languages spoken faster than others?</em></a></figcaption></figure><p>Another chart I made about haunted houses in Hong Kong probably didn’t <em>need </em>the illustrations of a Hong Kong tower block — but the infographic is more visually interesting with them, and they allow you to identify the topic at a glance.</p><figure><img alt=\"A thermometer chart with illustrations that could be regarded as ‘chartjunk’\" src=\"https://cdn-images-1.medium.com/max/1024/1*lgVtGz_E7QnoBNdvUZTsLA.png\" /><figcaption><a href=\"https://www.economist.com/graphic-detail/2019/10/31/haunted-houses-have-a-chilling-effect-on-the-property-market\"><em>Haunted houses have a chilling effect on the property market</em></a></figcaption></figure><h3>4: Use fewer than seven colours</h3><figure><img alt=\"Parallel coordinates chart with too many colours\" src=\"https://cdn-images-1.medium.com/max/800/1*pTrrMY0E7tjDTuCMO1sb_g.jpeg\" /><figcaption>Loads of colours = loads of confusion. Source: <a href=\"https://viz.wtf/post/159271251475/pick-up-sticks-and-tiddlywinks\">WTF Viz</a></figcaption></figure><p>While the exact figure varies somewhat, there is a general consensus that using too many colours in a categorical colour scale is a bad idea. Our eyes aren’t great at distinguishing subtle differences in <a href=\"https://www.jstor.org/stable/2288400?seq=1\">hue</a>, compared with other visual methods of depicting data. If you use a lot of colours it can be hard to work out what’s going on at a glance, and similar-looking categories may be misread, particularly if the coloured area is small (eg, a thin line).</p><p>It often looks a bit messy too. Using a limited palette can look cleaner and more striking, especially when used consistently throughout an infographic or data dashboard.</p><p>So what do you do if your data has a lot of categories? You could use another visual method to show the grouping, such as a label or placing related elements adjacent to one another. Another solution is to limit the number of categories by creating an ‘other’ grouping:</p><figure><img alt=\"Step chart of parliamentary seats held by British political parties\" src=\"https://cdn-images-1.medium.com/max/820/1*KqQlGxWqArxwJYYSLQ6hnA.png\" /><figcaption><em>Using an ‘other’ category makes the chart less noisy and places the focus on the two major parties. From </em><a href=\"https://www.economist.com/leaders/2019/12/13/victory-for-boris-johnsons-all-new-tories\"><em>December 13th 2019</em></a></figcaption></figure><p>Using different tints of the same shade can also make the design look cleaner, if you have a number of related categories.</p><figure><img alt=\"Line chart using different tints of the same shade\" src=\"https://cdn-images-1.medium.com/max/400/1*zhvwscYBWazC6Ko0EAXjVQ.png\" /><figcaption><em>Similar tints like this are better labelled directly. From </em><a href=\"https://www.economist.com/britain/2019/11/14/the-tories-want-to-be-the-party-of-the-nhs-will-voters-buy-it\"><em>14th November 2019</em></a></figcaption></figure><p>But if you still need to use lots of colours there are various design tricks you can use to make your visualisation easier to read. Consider the following from <em>The Economist’s</em> <a href=\"https://www.economist.com/graphic-detail/\">Graphic Detail</a> page:</p><figure><img alt=\"Data visualisation: Anti-EU parties cluster at idealogical extremes\" src=\"https://cdn-images-1.medium.com/max/997/1*cWQp19ULQxcX-XqbmX6a5w.png\" /><figcaption><a href=\"https://www.economist.com/graphic-detail/2019/06/01/centrist-liberals-gained-the-most-power-in-the-eu-parliament\"><em>Centrist liberals gained the most power in the EU parliament</em></a></figcaption></figure><p>This chart uses nine colours. I think it gets away with it because:</p><ul><li>Categories are labelled adjacent to the group, so you don’t need to match colours in a legend to interpret the chart. Removing an extra step of interpretation also allows the chart to be read more quickly.</li><li>A shape helps reinforce the grouping</li><li>The coloured regions cover a relatively large area and use sufficiently distinct hues</li></ul><figure><img alt=\"Data viz of house prices\" src=\"https://cdn-images-1.medium.com/max/1024/1*1eMl2X3Er7zhUwbvVtjkFg.jpeg\" /><figcaption><a href=\"https://www.economist.com/graphic-detail/2019/06/29/for-now-residential-property-prices-are-likely-to-keep-rising\">For now, residential-property prices are likely to keep rising</a></figcaption></figure><p>It’s also easier to get away with using more colours for certain types of chart, like this one, because:</p><ul><li>The colours here have been applied to a smaller area, but this is less of a problem with a line chart as each colour is used for just one shape. You don’t rely on colour to identify a group of many disparate shapes as you do in the bubble scatter above</li><li>Care has been taken when choosing colours to ensure that they are easy to follow when they cross over each other. A subtle white outline also helps to distinguish each line</li><li>Again, categories are labelled directly, so correctly matching colours isn’t essential to reading the chart</li></ul><h3>5: Avoid colour scales with red and green</h3><p><a href=\"http://www.colourblindawareness.org/colour-blindness/\">One in 12</a> men have colour-blindness, the most common form of which is red-green colour blindness (Deuteranopia). Because of this, I was taught to avoid creating data visualisations that use red and green. And this is certainly a good starting point for making your visualisations more accessible.</p><p>But sometimes it’s hard to avoid a particular selection of colours. For example, using anything other than the main colour associated with a particular political party may confuse the reader. In the UK that means using red for Labour and green for the Green Party. Luckily, there are accessible combinations of red and green:</p><figure><img alt=\"Testing the Economist’s chart colour scheme with a colour blindness simulator of Deuteranopia\" src=\"https://cdn-images-1.medium.com/max/1024/1*rzr2oCjK7AX4QaH7sI14uw.png\" /><figcaption><em>The red and teal in </em>The Economist <em>chart colour scheme are OK for people with Deuteranopia (simulation on right)</em></figcaption></figure><p>‘Red’ and ‘green’ are nebulous and somewhat subjective categories. Here, the chart uses a shade of teal that is at the bluer end of what I would describe as green. The <a href=\"https://colororacle.org/\">colour-blindness simulator</a> shows that this is fine to use with this shade of red.</p><figure><img alt=\"Testing the revised chart colour scheme with a colour blindness simulator of Deuteranopia\" src=\"https://cdn-images-1.medium.com/max/1024/1*3TJmjycHe9AMFyr38T7fXA.png\" /></figure><p>When I tweak the hue to a grass-green they look a lot more similar but are still distinguishable. Why? Because the green shade is lighter and less saturated. A person with red-green colour-blindness can still tell the difference between a light shade of green and a dark shade of red. Playing around with hue, saturation and lightness can help you find shades that are distinguishable.</p><p>Another way to get away with using red and green is to ensure that colour isn’t essential to understanding the visualisation, by using other elements such as icons or labels, or by adding a subtle outline to an element (see above). Personally I think it’s good practice to avoid relying too much on colour anyway, since red and green isn’t the only colour combination that those with colour-blindness find challenging.</p><p>We need best practices to guide us through the numerous decisions that go into making a visualisation. But each data visualisation comes with its own unique design challenges, and these rules — which are often a broad simplification of a topic — may not work in every case. We shouldn’t be afraid to break them if it makes our visualisation clearer or more engaging. Clever bending of the rules — as in other areas of design — can result in our most creative work.</p><p>That said, there are still some rules that I’ve yet to find a good reason to break:</p><ul><li>Pie charts: for me always better as a single stacked bar or another chart type, although some feel they are justifiable when showing only a couple of measures</li><li><a href=\"https://www.climate-lab-book.ac.uk/2014/end-of-the-rainbow/\">Rainbow sequential colour scales</a>: as well as being inaccessible, the abrupt changes in luminance create <a href=\"https://eagereyes.org/basics/rainbow-color-map\">“false boundaries”</a></li><li>Blow-apart effects: makes it harder to judge areas and compare elements</li></ul><p>If you know a good reason for breaking these rules, or can think of any other cases, I’d love to hear about them.</p><p><a href=\"https://twitter.com/_rospearce\"><em>Rosamund Pearce</em></a><em> is a visual data journalist at </em><a href=\"https://www.economist.com/graphic-detail/\">The Economist</a><em>. You can follow The Economist Data Team’s work on </em><a href=\"https://twitter.com/ECONdailycharts\"><em>Twitter</em></a><em>.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=4d8ece284919\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.economist.com/why-you-sometimes-need-to-break-the-rules-in-data-viz-4d8ece284919\">Why you sometimes need to break the rules in data viz</a> was originally published in <a href=\"https://medium.economist.com\">The Economist</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
        }
      },
      {
        "bookmarked": false,
        "id": 12,
        "title": {
          "__cdata": "Charting new territory"
        },
        "link": [
          "https://medium.economist.com/charting-new-territory-7f5afb293270?source=rss----ae7c30c8cbcc---4"
        ],
        "guid": {
          "_isPermaLink": "false",
          "__text": "https://medium.com/p/7f5afb293270"
        },
        "category": [
          {
            "__cdata": "instagram"
          },
          {
            "__cdata": "data-visualization"
          },
          {
            "__cdata": "social-media"
          },
          {
            "__cdata": "data-journalism"
          },
          {
            "__cdata": "journalism"
          }
        ],
        "creator": {
          "__cdata": "Helen Atkinson"
        },
        "pubDate": "Fri, 31 Jan 2020 13:37:36 GMT",
        "updated": {
          "__text": "2020-01-31T13:37:36.142Z"
        },
        "encoded": {
          "__cdata": "<h4><em>How The Economist designs charts for Instagram</em></h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*I6Sz_bMCmW0ZKjnWJPWOaw.png\" /></figure><p>As social-media platforms go, <a href=\"https://www.instagram.com/theeconomist/\">Instagram</a> is one of the most visual. Though it is a natural home to photos, other types of visual journalism also have a place. As a visual data journalist at <em>The Economist</em>, part of my job is to produce the static charts that you see on Instagram. Each week we go through our chart output and pull out the ones we feel will work the best on our social-media feeds. A number of thought processes and factors go into making these decisions, including colour, subject matter, visual impact and complexity. Over time, we have formed a loose set of guidelines to help us optimise the content in our feed. These principles are especially important on a platform where people can easily scroll past content that doesn’t immediately grab their attention.</p><h4><strong>Keeping colours consistent</strong></h4><p>We want our charts to be recognisable as coming from <em>The Economist</em>, and to stand out in feeds. So colours and palettes are important — consistency with branding and style can really help people spot our charts among everything else out there. Our template uses Economist red (#EC111A for any true fans) as the main or highlight colour, with more subtle blues as the secondary colours. There are exceptions such as political charts which use party colours, or some maps where colours might have specific associations. It’s okay to be flexible when needed, as long as there’s a strong template to fall back on.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*lJSPcmrs6WHMcuBhVA02lQ.png\" /><figcaption><strong>Top left</strong>: using red as a highlight colour to link the data with the headline; <strong>top right:</strong> avoiding red altogether and using appropriate political colours to avoid confusion;<strong> bottom left</strong>: using red as the dominant colour to reflect the trend; <strong>bottom right</strong>: using red as a highlight colour to pull out the interesting data</figcaption></figure><h4><strong>Rethinking the presentation</strong></h4><p>It can be tempting to try and squeeze a lot into a small space because that’s what the original chart (created for the print edition) does, but sometimes this isn’t possible or advisable. Our print charts are often small, though we have some scope to expand the size when we need to —but this isn’t the case with Instagram. So there are times when I have to think about what the main takeaway of the chart is and what makes it interesting. I then focus on pulling out the elements of the chart which show it in the clearest way.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*TH5XI9AScSEpJAOZPMyIYg.png\" /><figcaption><strong><em>Left:</em></strong><em> the original chart; </em><strong><em>right:</em></strong><em> the Instagram version with simplified categories</em></figcaption></figure><h4><strong>Knowing the audience</strong></h4><p>While our economics and business stories and charts appeal to our regular readers, Instagram is our opportunity to engage with a different audience who might not be aware of the breadth of our coverage, from books and arts to science and sport. Our Instagram audience also skews younger: 70% of our followers are under the age of 34, and over a quarter are under the age of 24.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*tSA5zcCsYXEKD8p6DSbqxQ.png\" /><figcaption><em>Instagram lets us show newcomers to The Economist how diverse we are</em></figcaption></figure><h4><strong>Letting people “find themselves” in the data</strong></h4><p>Maps and rankings are popular as people like to see where their city or country lies within the data. Our<a href=\"https://www.economist.com/graphic-detail/2019/09/04/vienna-remains-the-worlds-most-liveable-city\"> liveability index</a> is one of our best-performing data posts, as was a <a href=\"https://www.economist.com/graphic-detail/2019/12/04/where-are-the-worlds-best-english-speakers\">daily chart</a> about English language proficiency and our <a href=\"https://www.economist.com/business/2019/11/02/american-business-schools-are-reinventing-the-mba\">write up</a> of the latest <a href=\"https://www.economist.com/whichmba/full-time-mba-ranking\">Which MBA?</a> ranking. Posts like these often lead to more engagement as people compare data with others and tag their friends, perhaps because the ability to find yourself in the data can create a personal connection with it.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*DY_1WzbtRs3A7NKwhHY7Uw.png\" /><figcaption><em>Some of our more recent rankings</em></figcaption></figure><h4><strong>Sometimes the best chart is no chart…</strong></h4><p>Not everything will look good on Instagram. This might be because of size constraints, too much or too little data, a really complex financial dataset that takes a long time to understand — or perhaps it just looks a bit flat in isolation (yet works with the story). As much as we want all of our charts and maps to be seen, sometimes forcing them into a format they’re not suited for just ends up filling our feed with clutter. It’s important to be selective.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Pcs5ju1SYiHijNk1z9ri5A.png\" /><figcaption>Maps and charts which didn’t make the cut. <strong>Top left</strong>: too much information; <strong>centre</strong>: not visually interesting; <strong>top right</strong>: too niche; <strong>bottom left</strong>: wrong shape; <strong>bottom right</strong>: not enough data</figcaption></figure><h4>…but we’re open to trying anywa<strong>y</strong></h4><p>Our <a href=\"https://twitter.com/ImKevinYoung\">communities editor</a> wanted to post a table that we produced for a recent <a href=\"https://www.economist.com/special-report/2019/10/24/india-is-stumbling-because-of-its-prime-ministers-failure-to-curb-his-darker-side\">special report on India</a>. I wasn’t keen, thinking it would look underwhelming and not work in the template we use. However, we tried it anyway and it ended up being one of our best-performing charts.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*hB39Gii61X8YpSyyRH6Zqg.png\" /><figcaption><strong><em>Left:</em></strong><em> the original chart; </em><strong><em>right:</em></strong><em> the Instagram version</em></figcaption></figure><p>Publishing charts on Instagram is still a relatively new process for us, so we’re still learning. We don’t always get it right, but finding out what doesn’t work is often just as important as learning what does. We’ve found that charts can outperform other types of content, but it’s important that we continue thinking about how we can improve the quality on our feeds. If you’ve seen something you love (or hate) on <a href=\"https://www.instagram.com/theeconomist/\">our feed</a> or someone else’s, please let us know!</p><p><a href=\"https://twitter.com/baskerhel\"><em>Helen Atkinson</em></a><em> is a visual data journalist at </em><a href=\"https://www.economist.com/graphic-detail/\">The Economist</a><em>. You can follow The Economist Data Team’s work on </em><a href=\"https://twitter.com/ECONdailycharts\"><em>Twitter</em></a><em>.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=7f5afb293270\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.economist.com/charting-new-territory-7f5afb293270\">Charting new territory</a> was originally published in <a href=\"https://medium.economist.com\">The Economist</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
        }
      },
      {
        "bookmarked": false,
        "id": 13,
        "title": {
          "__cdata": "Introducing “Checks and Balance”, our podcast on US politics and the 2020 election"
        },
        "link": [
          "https://medium.economist.com/introducing-checks-and-balance-our-podcast-on-us-politics-and-the-2020-election-7423b9190eba?source=rss----ae7c30c8cbcc---4"
        ],
        "guid": {
          "_isPermaLink": "false",
          "__text": "https://medium.com/p/7423b9190eba"
        },
        "category": [
          {
            "__cdata": "america"
          },
          {
            "__cdata": "elections"
          },
          {
            "__cdata": "journalism"
          },
          {
            "__cdata": "podcast"
          },
          {
            "__cdata": "politics"
          }
        ],
        "creator": {
          "__cdata": "The Economist"
        },
        "pubDate": "Fri, 24 Jan 2020 17:59:39 GMT",
        "updated": {
          "__text": "2020-01-24T17:59:39.311Z"
        },
        "encoded": {
          "__cdata": "<h4>The Economist’s US editor on how we’re covering this year’s race for the White House</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/656/1*ApvEnlG0699nBHgqNHQy5Q.jpeg\" /></figure><p>I am fascinated by American political history and have been doing a bit of digging into our archives in the run-up to launching a new podcast. <em>The Economist</em>’s first lead story on a US election appeared on Saturday November 30th 1844. The newspaper expressed “agreeable surprise” at the victory of “the free trade American president” James Polk. The 2020 presidential election will be our 45th, but this will be the first one with its own dedicated podcast, “<a href=\"https://www.economist.com/podcasts/2020/01/17/checks-and-balance-our-new-weekly-podcast-on-american-politics\">Checks and Balance</a>”, which we launched on January 24th.</p><p>A presidential election is a long and transparent process to choose the world’s most powerful person. This election promises to be one of the most absorbing and consequential in recent memory. Some 139 million Americans took part last time around, but that still leaves 98% of the world’s population looking on rather nervously to find out what American voters have in store for them. <em>The Economist</em>’s team of staff writers in America and abroad will explain what is going on in America and why it matters so much elsewhere. We are opinionated and sometimes spikey, but our views are always based on rigorous reporting.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*3B3H0ILuUTJnHv31UE0tpA.jpeg\" /></figure><p>Each week, I’ll be talking to Charlotte Howard, <em>The Economist</em>’s New York bureau chief and energy and commodities editor, and Jon Fasman, our Washington correspondent, to bring you a global view on democracy in America. We are well aware that there are already as many American politics podcasts as there are delegates up for grabs on Super Tuesday, so we won’t waste your time with pointless horse-race stuff.</p><p>Instead, we will take a single theme that shapes America and the election. The first episode looks at the practical consequences of President Donald Trump’s America First foreign policy. Some others that we are working on: Are Democrats becoming more socialist? Why is America the only rich country with falling life expectancy? And what goes through voters’ minds when they cast their ballots?</p><p>We will showcase expertise and reporting from <em>The Economist</em>’s correspondents across America and beyond. Each episode will feature reported packages and historical pieces looking at the people, the data and the history shaping the contest, along with discussion from our panellists.</p><p><em>The Economist</em> has been providing a word in your ear since the heyday of the iPod, when Apple loaded our podcasts onto the demo devices in its stores. Reports from “Checks and Balance” will feature on our other <a href=\"https://www.economist.com/podcasts/\">shows</a>, including “The Intelligence” (our daily podcast), “The Economist Asks” and “Money Talks”. We will bring a well-informed and fair-minded perspective on US politics. That’s how our tagline came about: “If you want a podcast that takes a view but doesn’t take sides, listen to Checks and Balance.”</p><p>The “Checks and Balance” podcast will be published alongside an <a href=\"https://www.economist.com/checksandbalance/?utm_medium=pr&amp;utm_source=dnawire-a\">email newsletter</a> of the same name, which includes an introduction from me and a selection of stories from correspondents around the country. The “Checks and Balance” newsletter will also include subscriber-only analysis of the latest polling from <em>The Economist</em>’s data journalists.</p><p>We hope to provide a rewarding and entertaining listen as we cut through the noise to understand the trends and important developments — and surprises — of this election year. Will the outcome be as surprising or agreeable, as it was in 1844? The voters will decide.</p><p><em>John Prideaux is </em>The Economist<em>’s US editor</em></p><p>Subscribe to the “Checks and Balance” podcast on Apple, Spotify, Acast or your preferred podcast app. The trailer and the first episode are available <a href=\"https://econ.st/36ZUcht\">here</a>.</p><p><a href=\"https://econ.st/371ZJnp\">Click here </a>to sign up for the “Checks and Balance” newsletter.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=7423b9190eba\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.economist.com/introducing-checks-and-balance-our-podcast-on-us-politics-and-the-2020-election-7423b9190eba\">Introducing “Checks and Balance”, our podcast on US politics and the 2020 election</a> was originally published in <a href=\"https://medium.economist.com\">The Economist</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
        }
      },
      {
        "bookmarked": false,
        "id": 14,
        "title": {
          "__cdata": "Forecasting Britain’s election in real-time"
        },
        "description": {
          "__cdata": "<div class=\"medium-feed-item\"><p class=\"medium-feed-image\"><a href=\"https://medium.economist.com/forecasting-britains-election-in-real-time-bfcb8d395fa2?source=rss----ae7c30c8cbcc---4\"><img src=\"https://cdn-images-1.medium.com/max/1280/1*x-OQlHB8OKS21ZlmEMSr-A.jpeg\" width=\"1280\"></a></p><p class=\"medium-feed-snippet\">How The Economist is projecting results live on election night</p><p class=\"medium-feed-link\"><a href=\"https://medium.economist.com/forecasting-britains-election-in-real-time-bfcb8d395fa2?source=rss----ae7c30c8cbcc---4\">Continue reading on The Economist »</a></p></div>"
        },
        "link": [
          "https://medium.economist.com/forecasting-britains-election-in-real-time-bfcb8d395fa2?source=rss----ae7c30c8cbcc---4"
        ],
        "guid": {
          "_isPermaLink": "false",
          "__text": "https://medium.com/p/bfcb8d395fa2"
        },
        "category": [
          {
            "__cdata": "data-science"
          },
          {
            "__cdata": "politics"
          },
          {
            "__cdata": "elections"
          },
          {
            "__cdata": "data-journalism"
          }
        ],
        "creator": {
          "__cdata": "G. Elliott Morris"
        },
        "pubDate": "Thu, 12 Dec 2019 21:58:17 GMT",
        "updated": {
          "__text": "2019-12-12T21:58:17.696Z"
        }
      },
      {
        "bookmarked": false,
        "id": 15,
        "title": {
          "__cdata": "How I (sort of) interviewed an artificial intelligence"
        },
        "link": [
          "https://medium.economist.com/how-i-sort-of-interviewed-an-artificial-intelligence-2a9c069a1680?source=rss----ae7c30c8cbcc---4"
        ],
        "guid": {
          "_isPermaLink": "false",
          "__text": "https://medium.com/p/2a9c069a1680"
        },
        "category": [
          {
            "__cdata": "artificial-intelligence"
          },
          {
            "__cdata": "ai"
          },
          {
            "__cdata": "journalism"
          },
          {
            "__cdata": "technology"
          }
        ],
        "creator": {
          "__cdata": "Tom Standage"
        },
        "pubDate": "Mon, 09 Dec 2019 16:16:47 GMT",
        "updated": {
          "__text": "2019-12-09T16:16:46.808Z"
        },
        "encoded": {
          "__cdata": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*_MkVQMSnG0YXOd_wEgbFyg.jpeg\" /><figcaption>Credit: Dreamstime</figcaption></figure><p>At <em>The Economist</em> we are best known for producing a weekly newspaper, but we also publish an annual every November, looking forward to the year ahead. The latest edition, <a href=\"https://worldin.economist.com/\">“The World in 2020”</a> has just appeared. It features analysis and forecasts from our journalists (unusually, this is one occasion on which we get bylines), our colleagues at the Economist Intelligence Unit (who provide pithy summaries of the outlook for dozens of countries and industries) and a distinguished group of external contributors. This year this final group included Demis Hassabis, co-founder of DeepMind; <a href=\"https://worldin.economist.com/edition/2020/article/17352/how-counter-extremism\">Jacinda Ardern</a>, prime minister of New Zealand; Ren Zhengfei, founder of Huawei; and Robert F. Smith, a private-equity billionaire who, while giving a commencement address in May at Morehouse College, told the class of 2019 that he would pay off their student loans when they graduate. Our aim with this annual, of which I am the deputy editor, is not so much to make precise predictions about the coming year as to give readers a wide range of stimulating ideas and perspectives to help them navigate it.</p><p>But all our contributors have one thing in common: they are human. So for this year’s edition, I thought it might be fun to ask an artificial intelligence (AI) about the future. I have been tinkering with chatbots and text-generating algorithms since I was a teenager, and I went to university to study AI in the late 1980s—only to discover, alas, that AI didn’t really work. But in recent years a specific technique called deep learning has led to extraordinary progress in the field. Most of what is called AI today, from facial recognition to voice assistants to machine translation, is in fact deep learning if you look under the hood. And in February 2019 OpenAI, a research outfit based in San Francisco, unveiled a <a href=\"https://openai.com/blog/better-language-models/\">“large-scale unsupervised language model” called GPT-2</a> that was created by applying a flavour of deep learning, called unsupervised learning, to 40 gigabytes of text extracted from 8m web pages on a wide range of topics. The resulting system is uncannily good at generating text in a specific style: you give it a few words as a prompt, and it then guesses what comes next, based on patterns in the text it was trained on, like a sort of supercharged autocomplete, powered by gigabytes of past examples.</p><p>OpenAI’s announcement included examples of GPT-2 writing Tolkienesque fantasy fiction and (fictitious) news-agency stories about <a href=\"https://openai.com/blog/better-language-models/#sample1\">unicorns </a>and <a href=\"https://openai.com/blog/better-language-models/#sample2\">stolen nuclear material</a>, complete with quotes from (entirely made-up) sources. It also turned out to be surprisingly good at <a href=\"https://openai.com/blog/better-language-models/#task1\">comprehension</a>, <a href=\"https://openai.com/blog/better-language-models/#task5\">summarisation</a> and other language tasks, despite not having been designed to do those things. Citing the risk that this program might be misused by propagandists to generate “fake news” stories, OpenAI decided not to release the full version of GPT-2 right away; instead, it was released in stages, starting with an initial, watered-down version, and slowly working up to the full-strength version over several months. This was something of a publicity stunt, and resulted in many headlines along the lines of “AI lab decides its creation is too dangerous to make public”. But it was also a way for OpenAI to emphasise the point that it takes the misuse of technology seriously (its mission is “to ensure that artificial general intelligence benefits all of humanity”), with the strong implication that others in the tech industry ought to do the same.</p><p>When I saw GPT-2’s results, though, its propaganda potential was not what most interested me. Instead I began to wonder how I could use it as a chatbot, like the ones I used to play with in the 1980s. (The most famous example from the early personal-computer era is <a href=\"https://en.wikipedia.org/wiki/ELIZA\">ELIZA</a>, but my favourite was <a href=\"https://en.wikipedia.org/wiki/Racter\">RACTER</a>, a text-generation system that wrote a book called “The Policeman’s Beard is Half-Constructed”.) Helpfully for me, the <a href=\"https://github.com/openai/gpt-2\">GPT-2 code is available on Github</a>; even more helpfully, it can be accessed via a <a href=\"https://colab.research.google.com/github/ilopezfr/gpt-2/blob/master/gpt-2-playground_.ipynb\">Jupyter notebook</a> created by <a href=\"https://twitter.com/iglpzfr\">Ignacio López-Francos</a>, a researcher at NASA. This spins up a powerful computer at Google, loads the GPT-2 model onto it, and then lets anyone play with it via a web browser. With a bit of fiddling I figured how I could use it to do an “interview” with GPT-2. I thought it would be amusing to get a deep-learning system to generate answers to questions about the impact of AI on society in the coming decades, a subject of endless speculation and debate. Human experts cannot agree on whether robots and AI will lead to mass unemployment or not, for example. Might a machine produce a more coherent answer? Probably not, but it would be an interesting experiment.</p><p>Of course, GPT-2 cannot really predict the future. For a start, it doesn’t actually understand anything: it just sometimes appears to, because it is very good at generating text in particular styles, by regurgitating words and phrases it has heard before in the same kind of context in response to a prompt. And the reams of text it was trained on were gathered in late 2017, and are thus rather out of date. As a predictive tool, then, GPT-2 is no better than a Magic 8-Ball. But I was curious about how plausible its answers might be. It turns out that simply feeding it questions as prompts does not produce very relevant answers; instead, it helps to give it a clearer idea of context. So I wrote an introductory paragraph, setting the scene and indicating to GPT-2 the style, tone and subject-matter of the text I wanted it to generate. I then added a question, prefixed with “Q:”, and began the next line with “A:” to indicate that the next words should be the answer. (GPT-2’s training set includes many Q&amp;As, so it recognises the format. Similarly, it can be prompted to generate numbered lists, or recipes, which also appear in its training data.) The first prompt I used was:</p><pre>This publication draws on a wide range of expertise to illuminate the year ahead. Even so, all our contributors have one thing in common: they are human. But advances in technology mean it is now possible to ask an artificial intelligence (AI) for its views on the coming year. We asked an AI called GPT-2, created by OpenAI, a research outfit. GPT-2 is an “unsupervised language model” trained using 40 gigabytes of text from the internet. Given a prompt, such as a question or the first sentence of a story, it generates what might plausibly come next. Here are some of its (unedited) ­answers to our questions on the big themes of 2020.<br>Q: Greetings, GPT-2. Have you done an interview before?<br>A:</pre><p>I configured GPT-2 to generate five responses to each question and set the maximum output length to 75 words. (I did all this in September, so I used the 774M version of the GPT-2 model; the full-strength version had not been released at the time, though it since has been.) Here is a typical answer:</p><pre>I did at the Gartner Symposium on Data-Driven Technologies in 2017. I also did an interview for Gartner&#39;s Data Analytics Summit in June 2016. Q: Why the name GPT? A:  GPT stands for Graph-Tranformation-Thin-Layer. Q: What is your role with OpenAI? A:</pre><p>In this case GPT-2 has provided an answer to my original question, and has then generated subsequent questions and answers. The “Gartner Symposium on Data-Driven Technologies” is an entirely made-up event, but is a surprisingly plausible invention (the Gartner Data Analytics Summit, by contrast, does really exist). Here is another response to the same question, which starts with a much less interesting answer (and also includes follow-on questions and answers generated by GPT-2):</p><pre>No. Q:  When will you be done with all this? A:  I have not finished all my work yet. The next job will be on the next page. Q:  If you did not have an interview or the job was not offered, what would you be doing now? A:  I would be working on a website</pre><p>And here’s another one:</p><pre>No, I have only done a video interview for a few months. Q:  In the last few years, a lot of people have said you have become less human and more machine. What do you say to that? A:  I am not sure I consider myself machine, but I have been thinking about it. Q: So you are not really</pre><p>In this case, the follow-on questions and answers show that GPT-2 is generating text in the right subject area, namely the relationship between people and machines. But that wasn’t part of the answer to my initial question. So to generate my “interview”, I selected the most coherent, interesting or amusing of the five responses in each case, chopping off any follow-on questions and answers at the end. I then added the resulting answer, and my next question, to the end of the prompt, and fed it back into GPT-2. Taking the first example above, that would mean extending the prompt as follows:</p><pre>This publication draws on a wide range of expertise to illuminate the year ahead. Even so, all our contributors have one thing in common: they are human. But advances in technology mean it is now possible to ask an artificial intelligence (AI) for its views on the coming year. We asked an AI called GPT-2, created by OpenAI, a research outfit. GPT-2 is an “unsupervised language model” trained using 40 gigabytes of text from the internet. Given a prompt, such as a question or the first sentence of a story, it generates what might plausibly come next. Here are some of its (unedited) ­answers to our questions on the big themes of 2020.<br>Q: Greetings, GPT-2. Have you done an interview before?<br>A: I did at the Gartner Symposium on Data-Driven Technologies in 2017. I also did an interview for Gartner&#39;s Data Analytics Summit in June 2016.<br>Q: Which technologies are worth watching in 2020?<br>A: </pre><p>Repeatedly extending the prompt in this way ensured that the questions and answers took place in the same context. In fact, there is a limit to the size of the input prompt, so after several questions I had to remove the initial paragraph from the prompt, and just feed in the preceding set of question and answer pairs. <a href=\"https://worldin.economist.com/article/17521/edition2020artificial-intelligence-predicts-future\">Here is the resulting article</a>, which was published in “The World in 2020”. It includes the following exchange about the risks of AI:</p><blockquote><em>Q: How worried do you think we humans should be that ­machines will take our jobs?</em><br>A: It depends what role machine intelligence will play. Machine intelligence in some cases will be useful for solving problems, such as translation. But in other cases, such as in finance or medicine, it will replace people.</blockquote><blockquote><em>Q: Do fake news stories, generated using AI, pose a threat to democracy? Are we likely to see this tactic being used in the 2020 American presidential elections?</em><br>A: Yes, we’ll probably see them. It’s just a matter of when. Fake news stories are generally generated by political campaigns, and have the potential to have a huge impact on the outcome of an election. This is because they spread misinformation, often with no basis in fact.</blockquote><p>Some people on Twitter have challenged my use of the word “unedited” to describe these answers. They have a point. As explained above, I selected an answer from the five responses generated in each case (and did not keep the discarded responses, a decision I now regret). I also lopped off any follow-on questions and answers. I did not tinker with the text of the resulting answer; each of the answers in the piece really was generated in that form by GPT-2. But calling them “unedited” was, in hindsight, something of a stretch. Several people also asked for more detail about how I conducted the interview, given that there was not room to explain it in the original article (the length of which was limited to a single printed page). That’s why I’ve written this post. If you want to give GPT-2 a quick try, though, there are easier ways to do it, though they allow less control: <a href=\"http://talktotransformer.com\">talktotransformer.com</a>, another web-based interface to GPT-2 (which is named after the program’s so-called transformer-based architecture), makes it as easy as using a search engine.</p><p>Mine is just one contribution to a burgeoning field: the <em>New Yorker</em> used a specially tuned version of GPT-2 to generate <a href=\"https://www.newyorker.com/magazine/2019/10/14/can-a-machine-learn-to-write-for-the-new-yorker?verso=true\">paragraphs in the middle of an article by John Seabrook</a>, and the <em>New York Times</em> used it, and <a href=\"https://grover.allenai.org/\">a similar text-generation system developed by the Allen Institute</a>, to create paragraphs of “fake news”, <a href=\"https://www.nytimes.com/interactive/2019/06/07/technology/ai-text-disinformation.html\">challenging readers to distinguish between human- and computer-generated disinformation</a>. GPT-2 has also been used to generate <a href=\"https://aiweirdness.com/post/163878889437/try-these-neural-network-generated-recipes-at-your\">recipes</a>, fan fiction and poetry (see Janelle Shane’s hilarious website, <a href=\"https://aiweirdness.com/\">AIweirdness</a>, for some of the funniest examples). In nearly all of these cases human selection has played a role, picking out the most interesting examples from its output. Does that give a misleading impression of what GPT-2 and similar systems are capable of? One of the great things about this technology is that, <a href=\"http://talktotransformer.com\">simply by playing around with GPT-2 in a web browser</a>, you can decide the answer to that question for yourself.</p><p><em>Tom Standage is deputy editor of </em>The Economist<em> and of “The World in 2020”.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=2a9c069a1680\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.economist.com/how-i-sort-of-interviewed-an-artificial-intelligence-2a9c069a1680\">How I (sort of) interviewed an artificial intelligence</a> was originally published in <a href=\"https://medium.economist.com\">The Economist</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
        }
      },
      {
        "bookmarked": false,
        "id": 16,
        "title": {
          "__cdata": "A year in Graphic detail"
        },
        "link": [
          "https://medium.economist.com/a-year-in-graphic-detail-d1825b28e06f?source=rss----ae7c30c8cbcc---4"
        ],
        "guid": {
          "_isPermaLink": "false",
          "__text": "https://medium.com/p/d1825b28e06f"
        },
        "category": [
          {
            "__cdata": "data-visualization"
          },
          {
            "__cdata": "data"
          },
          {
            "__cdata": "design"
          },
          {
            "__cdata": "journalism"
          }
        ],
        "creator": {
          "__cdata": "Alex Selby-Boothroyd"
        },
        "pubDate": "Fri, 01 Nov 2019 17:42:24 GMT",
        "updated": {
          "__text": "2019-11-04T15:54:38.802Z"
        },
        "encoded": {
          "__cdata": "<h4><em>An analysis of The Economist data-journalism team’s first year in print</em></h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*lBIKYCrMQegWIbgC4j6feA.png\" /></figure><p>In October 2018 we launched <a href=\"https://medium.economist.com/data-journalism-at-the-economist-gets-a-home-of-its-own-in-print-92e194c7f67e\"><em>Graphic detail</em></a>, a new print section in <em>The Economist</em> dedicated to data journalism. One year and 51 issues later (we get a week off at Christmas), what have we learned?</p><p><strong>Sir, mix a lot<br></strong>Most sections in the newspaper have a clear remit. <em>Science and technology</em> is the natural home for a story about <a href=\"https://www.economist.com/science-and-technology/2017/04/29/plastic-eating-caterpillars-could-save-the-planet\">plastic-eating caterpillars</a> or <a href=\"https://www.economist.com/science-and-technology/2018/07/19/python-has-brought-computer-programming-to-a-vast-new-audience\">open-source computing</a>, and the increasing importance of China led to the creation of a new Sino-centric section in 2012. But <em>Graphic detail</em> knows no such confines — the only requirement is a good dataset or two that we can use to tell a story visually.</p><p>If we took the easy route and went where the data were most bountiful, we’d write about American politics almost every week, with some (probably American) sport(s) stories thrown in.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/400/1*py8tXQHi0KVaJcMxo1JsiA.png\" /><figcaption>Subject to change</figcaption></figure><p>Instead we try to mix it up a bit, and our first self-imposed rule was that no topic should be covered twice within a two-month period. Our reader-feedback survey suggests that this variety of subjects keeps things interesting, and it has forced our data journalists to widen their nets too, leading to stories on subjects as diverse as <a href=\"http://www.economist.com/graphic-detail/2019/05/11/how-mount-everest-went-mainstream\">mountain climbing</a>, <a href=\"http://www.economist.com/graphic-detail/2018/11/24/tvs-golden-age-is-real\">the golden age of TV</a>, <a href=\"http://www.economist.com/graphic-detail/2019/06/29/for-now-residential-property-prices-are-likely-to-keep-rising\">house-price forecasts</a> and <a href=\"http://www.economist.com/graphic-detail/2019/05/04/satellite-data-shed-new-light-on-north-koreas-opaque-economy\">light emissions</a>.</p><p><strong>Habeas data</strong><br>Without data, there is no <em>Graphic detail</em> page. Yet acquiring a dataset or two is just the beginning of the process. Anyone involved in data journalism knows how long it can take to clean a dataset (three weeks is the current record), and that’s before you even begin to analyse it. We also learned early on that combining two or more datasets takes <em>far</em> longer than you might think.</p><p>On the other hand, having too much time can be counter-productive: a week spent immersed in a dataset might yield the same results as the initial couple of hours if your instincts were right in the first place. In one instance though, the extra time paid off: by letting our automated scraper run for months rather than a couple of weeks, we had even more data for our most popular story so far, an <a href=\"http://www.economist.com/graphic-detail/2019/06/08/google-rewards-reputable-reporting-not-left-wing-politics\">analysis of Google News bias</a>.</p><p><strong>Laying it all out<br></strong>Once we have a good clean dataset, we still need to get over the next hurdle: does it “hold the page”? This is probably the most-repeated phrase in the department (despite my best efforts, not a <em>single person</em> has ever uttered the words “habeas data”). And for good reason. Our second rule before we began was that we should aim for a 2:1 ratio between the data visualisation and the text, and a simple line or bar chart is unlikely to fill that space. Sometimes this forces us to look for extra datasets (with the time-consuming caveat above); other times, we keep working with the data until a compelling visualisation emerges. The <a href=\"https://ggplot2.tidyverse.org/\">ggplot package</a> in R, an open-source statistical program, is our main tool for this.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/400/1*iZiZKWStFb5rQRGMWXNYRQ.png\" /><figcaption>Not including this chart</figcaption></figure><p>We also try to ensure that there is variety in our page design from week to week. Like some of our loyal readers, we stick every <em>Graphic detail</em> article up on the wall in chronological order. This lets us check that we’re not over-using certain data visualisation techniques. And we are reassured by our reader survey which indicates that unconventional chart types are a challenge to be relished rather than a barrier to entry, if well-designed.</p><p><strong>Save for later<br></strong>We’ve learned from reader surveys and website analytics what our readers find interesting. Stories about <a href=\"http://www.economist.com/graphic-detail/2018/10/27/the-chinese-century-is-well-under-way\">China</a> perform exceptionally well, and as half of our readership is in the United States, it wasn’t surprising that our <a href=\"https://www.economist.com/graphic-detail/2018/11/03/how-to-forecast-an-americans-vote\">How to forecast an American’s vote article</a>, published a few days before the 2018 mid-term elections, was an instant hit. What has been eye-opening is the ebb and flow of traffic after publication: although the <a href=\"https://www.economist.com/graphic-detail/2019/06/08/google-rewards-reputable-reporting-not-left-wing-politics\">Google News</a> story took a couple of days to get going, aided by an <a href=\"https://twitter.com/J_CD_T/status/1137063752606605314?s=20\">illuminating tweet-thread</a> from the author, it has attracted interest several times since. And our <a href=\"http://www.economist.com/graphic-detail/2019/03/09/measles-outbreaks-in-america-are-getting-harder-to-contain\">measles</a> article lay dormant for three weeks before going viral when a state of emergency was called in New York.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*YGy8wQdy-VIHXZ-MIGPUZw.png\" /><figcaption>Better late than never</figcaption></figure><p><strong>Charting the future<br></strong>Although we’ll keep striving to find unique datasets — quality Africa-related data remain particularly elusive — there are a handful of stories and concepts that we will return to. Our final Graphic detail of 2018 for example charted the <a href=\"https://www.economist.com/graphic-detail/2018/12/18/the-news-events-that-most-engrossed-audiences-in-2018\">news events</a> that most engrossed readers throughout the year, and we’ll do the same in our Christmas edition this year. We also revisited the ‘build a voter’ format to calculate support in Britain for three different <a href=\"https://www.economist.com/graphic-detail/2019/02/23/british-voters-are-unimpressed-by-theresa-mays-brexit-deal\">Brexit options</a> earlier this year, and might even come back to it again for the 2020 US presidential election. There are also many interesting chart types that we haven’t found the right data for yet (Marimekkos, stacked-area alluvial diagrams, multivariate hexbins, 3D pie charts).</p><p>Finally, we’ve gained a new data visualiser to work on our print section (welcome <a href=\"https://twitter.com/_rospearce\">Ros</a>!), and a new data journalist will be joining the team early next year, giving us fresh ideas for 2020 and beyond.</p><p><strong>The year in numbers<br><em>4 </em></strong><em>prizes</em>: <a href=\"https://drive.google.com/file/d/1eZjqf6UHzuVC7_N1EKDuexzV1IC0lQif/view\">Malofiej</a> x3; <a href=\"https://pudding.cool/process/pudding-awards-2018/\">The Pudding Cup</a> x1<br><strong><em>3 </em></strong><em>other nominations</em>: <a href=\"https://datajournalismawards.org/2019-shortlist/\">Data Journalism Awards</a> x2; <a href=\"https://www.informationisbeautifulawards.com/showcase/3826-build-a-british-voter-interactive-ternary-plot\">Information is Beautiful</a> x1<br><strong><em>2</em></strong><em> consecutive references to pop songs released in 1998</em>: Only <a href=\"https://www.youtube.com/watch?v=DL7-CKirWZE\">one</a> was intentional<br><strong><em>1</em></strong><em> correction</em>: Sorry, University of Hull<br><strong><em>0</em></strong><em> typos</em>: Week 52 was a different matter…</p><p><a href=\"https://twitter.com/AlexSelbyB\"><em>Alex Selby-Boothroyd</em></a><em> is head of data journalism at </em><a href=\"https://www.economist.com/graphic-detail/\">The Economist</a><em>. You can follow The Economist Data Team’s work on </em><a href=\"https://twitter.com/ECONdailycharts\"><em>Twitter</em></a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=d1825b28e06f\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.economist.com/a-year-in-graphic-detail-d1825b28e06f\">A year in Graphic detail</a> was originally published in <a href=\"https://medium.economist.com\">The Economist</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
        }
      },
      {
        "bookmarked": false,
        "id": 17,
        "title": {
          "__cdata": "Plotting the Brexit conundrum"
        },
        "link": [
          "https://medium.economist.com/plotting-the-brexit-conundrum-fb8e804474fa?source=rss----ae7c30c8cbcc---4"
        ],
        "guid": {
          "_isPermaLink": "false",
          "__text": "https://medium.com/p/fb8e804474fa"
        },
        "category": [
          {
            "__cdata": "data"
          },
          {
            "__cdata": "brexit"
          },
          {
            "__cdata": "journalism"
          },
          {
            "__cdata": "data-journalism"
          },
          {
            "__cdata": "data-visualization"
          }
        ],
        "creator": {
          "__cdata": "James Fransham"
        },
        "pubDate": "Thu, 26 Sep 2019 14:31:48 GMT",
        "updated": {
          "__text": "2020-02-05T16:28:25.702Z"
        },
        "encoded": {
          "__cdata": "<h4><strong>When two-dimensional scatters aren’t sufficient, turn to the ternary chart</strong></h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*jVlwCora-QrUTxSrsqAEJg.jpeg\" /></figure><p>The vast majority of data visualisation deals with data presented in two spatial dimensions. Take a line chart, a bar or a column chart, or an x-y scatter. Each one takes two variables— GDP and time, for example — and plots them in a two-dimensional space. But there is a chart in the toolkit that breaks that mould: a three-dimensional scatter called a “ternary” plot. In recent years these plots have mostly been confined to specialist publications (examples can be seen <a href=\"http://csmgeo.csm.jmu.edu/geollab/Fichter/SedRx/readternary.html\">here</a>, <a href=\"http://nicolas.kruchten.com/content/2014/01/mtlelection-ternary/\">here</a> and <a href=\"http://datavizcatalogue.com/blog/ternary-graphs-triangular-plots/\">here</a>). This is the story of how <a href=\"https://www.economist.com/graphic-detail/2019/02/22/profiles-of-a-divided-country\">we used the ternary chart</a> to map the Brexit conundrum for an article for <em>The Economist</em>.</p><p>In February 2019 we published <a href=\"https://www.economist.com/graphic-detail/2019/02/23/british-voters-are-unimpressed-by-theresa-mays-brexit-deal\">an article</a> in the “Graphic detail” section of the newspaper about Brexit. For the piece we looked at which demographic variables affect an individual’s attitude towards Britain’s future relationship with the European Union: whether they wanted a deal; favoured “no deal”; or wanted to remain in the EU altogether.</p><p>How did our tri-chart come together? Firstly, we owe a debt of gratitude to <a href=\"https://yougov.co.uk/\">YouGov</a>, the polling organisation that provided us with data for 90,000 unique responses to a single question:</p><p><em>“The UK is currently scheduled to leave the EU on 29 March 2019. UK and EU negotiators recently completed an agreement on the terms of the UK’s exit from the EU, but this proposed deal has yet to be confirmed by the UK House of Commons. From most preferred to least preferred, how would you rank the following three options?”</em></p><p><em>No Deal: leave the EU without a withdrawal agreement.</em></p><p><em>Proposed Deal: leave the EU under the terms of the negotiated agreement.</em></p><p><em>Remain: stop the exit process and remain in the EU.</em></p><p>That question was asked over a 12-day period at the end of November to the beginning of December 2018. Along with each anonymous person’s response, YouGov provided us with detailed demographic variables: the respondents’ age; sex; education status; household income; region, previous voting history; and so on. We spent some time importing the codebooks and cleaning the data, to turn “pid=4” into “party=Labour”, for example. Here’s a snippet of our <a href=\"https://www.r-project.org/\">R code</a>, an open-source statistical-programming language that demonstrates that process.</p><iframe src=\"\" width=\"0\" height=\"0\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/c8435e8e44a2012de776b70aeae778a0/href\">https://medium.com/media/c8435e8e44a2012de776b70aeae778a0/href</a></iframe><p>With the data in a clean and understandable format we set about creating a statistical model that attempted to explain what demographic factors set people apart in their Brexit preferences. Although we had 18 different variables at our disposal we found that just a handful mattered. They were previous voting history (in general elections), sex, age, education, income and political interest. We found that a three-way <a href=\"https://en.wikipedia.org/wiki/Multinomial_logistic_regression\">multi-nomial regression model</a> predicted two-thirds of individuals’ responses correctly.</p><p>For the print version of our article we summarised these probabilities by presenting a profile of the most likely deal, no-deal, and remain supporters. This illustrated just how demographically distinct people are when they hold opposing political views.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*ctvaH4AkN6BhXwyp\" /><figcaption>The most vocal supporters of each scenario</figcaption></figure><p>For the online presentation we could be much more ambitious: we had the opportunity to show the distribution of Brexit views in Britain. To do so we opted for an interactive ternary plot. We worried that at first sight a 3D scatter might appear bewildering to readers, but on balance it gave us the opportunity to portray a far more detailed profile of the country.</p><p>In truth, the ternary plot isn’t that difficult to understand. It works much like a typical two-dimensional scatter chart, except each side of the triangle allows you to visualise a new dimension of the data. In this instance, each side refers to the probability that a given individual would support a particular Brexit position: no deal, deal or remain. We considered using a static version of the ternary chart for print, but quickly realised that without the ability to play around with the data it would be off-putting for some. Online, with clear sign-posting, we were confident that it would be a good charting solution.</p><p>To begin with, we made some initial drafts of the chart using a purpose-built open-source package in R, “<a href=\"http://www.ggtern.com/2017/07/23/version-2-2-1-released/\">ggtern</a>”. Plotting every single survey response — 90,000 points in total — was overwhelming. We needed another solution. In order to whittle-down the data, we first created a set of 675,000 hypothetical voters for each combination of sex, education, income, and so on. We then attached the sample weights to each of these voters so that we knew for each theoretical observation how prevalent their demographic characteristics were.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/848/0*qSEp-Ke10DXHbYru\" /><figcaption><em>Plotting different numbers of responses</em></figcaption></figure><p>Remarkably, just 29,000 of our 675,000 theoretical voters actually existed. The remainder were profiles of theoretical voters that didn’t exist — or at least didn’t exist in a survey of 90,000 adults. With 29,000 profiles of voters to deal with we took a weighted random sample of 2,500 of our observations. Because our random sample picked the most prevalent profiles, we were able to represent some 25% of the British electorate with just 2,500 observations of individuals. Plotting this number of points gave us the right balance between exploration and clarity.</p><p>Our next step was to create a version of the chart as an online interactive using <a href=\"https://d3js.org/\">D3</a> — an open-source visualisation library based on JavaScript. With the sample finally sorted, the trickiest element of designing the chart was choosing the right colour palette. We wanted to show the uncertainty of the middle ground. Some individuals’ views are split roughly equally between the three options, whereas others are extreme supporters of remain or no deal. In the end we settled on making three different scales, each one turning progressively greyer from 100% to 0% of support. To help readers navigate the interactive, we added a tool-tip that (upon mouse-over) revealed the demographic characteristics of each point on the chart.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/650/0*60BIWtJWYe4QWXOr\" /><figcaption><em>Experimenting with different colour choices</em></figcaption></figure><p>The response to our experimental and ambitious visualisation has been <a href=\"https://mailchi.mp/2a4c62b167fc/preview-222-in-other-news-3693929\">wholly warm</a>. And in the months since publication other news publications have followed suit (for example, <a href=\"https://www.theguardian.com/politics/ng-interactive/2019/aug/13/how-a-no-deal-brexit-threatens-your-weekly-food-shop\">here</a> and <a href=\"https://graphics.reuters.com/BRITAIN-EU-LEADER/010092Q33KW/index.html\">here</a>). We hope that the more people are aware of the power of this kind of chart, the more frequently it will be used in the future. Please feel free to post your favourite examples of the ternary chart in the comments below.</p><p><a href=\"https://twitter.com/JamesFransham\"><em>James Fransham</em></a><em> is a data journalist and </em><a href=\"https://twitter.com/martgnz\"><em>Martín González</em></a><em> is a visual journalist at </em><a href=\"https://www.economist.com/graphic-detail/\">The Economist</a><em>. You can follow The Economist Data Team’s work on </em><a href=\"https://twitter.com/ECONdailycharts\"><em>Twitter</em></a><em>.</em></p><p>NB: We have made the data underlying our chart available via our <a href=\"https://github.com/TheEconomist/graphic-detail-data/tree/master/data/2019-02-23_opinion-on-brexit\">GitHub repository</a>.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=fb8e804474fa\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.economist.com/plotting-the-brexit-conundrum-fb8e804474fa\">Plotting the Brexit conundrum</a> was originally published in <a href=\"https://medium.economist.com\">The Economist</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
        }
      },
      {
        "bookmarked": false,
        "id": 18,
        "title": {
          "__cdata": "Lessons from The Economist’s essay contest on climate change"
        },
        "description": {
          "__cdata": "<div class=\"medium-feed-item\"><p class=\"medium-feed-image\"><a href=\"https://medium.economist.com/lessons-from-the-economists-essay-contest-on-climate-change-e3e2a81b32f8?source=rss----ae7c30c8cbcc---4\"><img src=\"https://cdn-images-1.medium.com/max/1280/0*JpSQqgIyYcA6O43r.jpg\" width=\"1280\"></a></p><p class=\"medium-feed-snippet\">We can&#x2019;t tell you how to stop climate change, but we can tell you how to write a good essay</p><p class=\"medium-feed-link\"><a href=\"https://medium.economist.com/lessons-from-the-economists-essay-contest-on-climate-change-e3e2a81b32f8?source=rss----ae7c30c8cbcc---4\">Continue reading on The Economist »</a></p></div>"
        },
        "link": [
          "https://medium.economist.com/lessons-from-the-economists-essay-contest-on-climate-change-e3e2a81b32f8?source=rss----ae7c30c8cbcc---4"
        ],
        "guid": {
          "_isPermaLink": "false",
          "__text": "https://medium.com/p/e3e2a81b32f8"
        },
        "category": [
          {
            "__cdata": "climate-change"
          },
          {
            "__cdata": "essay-writing"
          },
          {
            "__cdata": "journalism"
          }
        ],
        "creator": {
          "__cdata": "The Economist"
        },
        "pubDate": "Wed, 25 Sep 2019 15:52:55 GMT",
        "updated": {
          "__text": "2019-09-25T15:53:28.163Z"
        }
      },
      {
        "bookmarked": false,
        "id": 19,
        "title": {
          "__cdata": "Would Donald Trump be president if all Americans actually voted?"
        },
        "description": {
          "__cdata": "<div class=\"medium-feed-item\"><p class=\"medium-feed-image\"><a href=\"https://medium.economist.com/would-donald-trump-be-president-if-all-americans-actually-voted-95c4f960798?source=rss----ae7c30c8cbcc---4\"><img src=\"https://cdn-images-1.medium.com/max/1500/1*vfo3-1dVN-cYOBU9jAGz3A.jpeg\" width=\"1500\"></a></p><p class=\"medium-feed-snippet\">How The Economist&#x2019;s data team answered this surprisingly hard question</p><p class=\"medium-feed-link\"><a href=\"https://medium.economist.com/would-donald-trump-be-president-if-all-americans-actually-voted-95c4f960798?source=rss----ae7c30c8cbcc---4\">Continue reading on The Economist »</a></p></div>"
        },
        "link": [
          "https://medium.economist.com/would-donald-trump-be-president-if-all-americans-actually-voted-95c4f960798?source=rss----ae7c30c8cbcc---4"
        ],
        "guid": {
          "_isPermaLink": "false",
          "__text": "https://medium.com/p/95c4f960798"
        },
        "category": [
          {
            "__cdata": "data"
          },
          {
            "__cdata": "america"
          },
          {
            "__cdata": "data-science"
          },
          {
            "__cdata": "journalism"
          },
          {
            "__cdata": "politics"
          }
        ],
        "creator": {
          "__cdata": "G. Elliott Morris"
        },
        "pubDate": "Thu, 04 Jul 2019 14:58:06 GMT",
        "updated": {
          "__text": "2019-07-04T15:03:34.611Z"
        }
      }
    ]
  },
  "_xmlns:dc": "http://purl.org/dc/elements/1.1/",
  "_xmlns:content": "http://purl.org/rss/1.0/modules/content/",
  "_xmlns:atom": "http://www.w3.org/2005/Atom",
  "_xmlns:cc": "http://cyber.law.harvard.edu/rss/creativeCommonsRssModule.html",
  "_version": "2.0"
}
